## Learning Pandas

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

In [7]:
A = np.random.randn(6,4)

In [11]:
pd.DataFrame(A,
             columns=["age","height","weight","color"],
            index=["a","b","c","d","e","f"])

        age    height    weight     color
a  1.170943  0.496338  0.302315  1.606679
b -0.637163  1.552009 -0.666541  0.077478
c  0.876035 -0.039577 -0.880739 -0.235865
d  2.012537 -1.131242 -0.207857 -0.366879
e  0.175541 -0.604981 -0.578401 -0.339012
f  0.337699 -0.248381 -1.619250 -1.006224

In [12]:
df2 = pd.DataFrame({ 'A' : 1.,
'B' : pd.Timestamp('20130102'),
'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
'D' : np.array([3] * 4,dtype='int32'),
'E' : pd.Categorical(["test","train","test","train"]),
'F' : 'foo' })

df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [14]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E            object
F            object
dtype: object

In [15]:
df2.columns

Index([u'A', u'B', u'C', u'D', u'E', u'F'], dtype='object')

In [18]:
for column_name in df2.columns:
    print(column_name, df2[column_name].dtype)

('A', dtype('float64'))
('B', dtype('<M8[ns]'))
('C', dtype('float32'))
('D', dtype('int32'))
('E', dtype('O'))
('F', dtype('O'))

In [17]:
for row_name in df2.index:
    print(row_name)

0
1
2
3

In [20]:
df2["A"]

0    1
1    1
2    1
3    1
Name: A, dtype: float64

In [22]:
df2.T

,0,1,2,3
A,1,1,1,1
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [23]:
df2["T"] = [1,2,"bob","joe"]

In [24]:
df2.T

,0,1,2,3
A,1,1,1,1
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo
T,1,2,bob,joe

In [26]:
df2.max(axis=0)

A                      1
B    2013-01-02 00:00:00
C                      1
D                      3
E                  train
F                    foo
T                    joe
dtype: object

In [27]:
df2.max(axis=1)

0    3
1    3
2    3
3    3
dtype: float64

In [28]:
df2.mean(axis=0)

A    1
C    1
D    3
dtype: float64

In [29]:
df2.mean(axis=1)

0    1.666667
1    1.666667
2    1.666667
3    1.666667
dtype: float64

In [31]:
df2.head(1)

   A          B  C  D     E    F  T
0  1 2013-01-02  1  3  test  foo  1

In [32]:
df2.tail(2)

   A          B  C  D      E    F    T
2  1 2013-01-02  1  3   test  foo  bob
3  1 2013-01-02  1  3  train  foo  joe

In [33]:
df2.loc[0, :]

A                      1
B    2013-01-02 00:00:00
C                      1
D                      3
E                   test
F                    foo
T                      1
Name: 0, dtype: object

In [34]:
df2.loc[1, :]

A                      1
B    2013-01-02 00:00:00
C                      1
D                      3
E                  train
F                    foo
T                      2
Name: 1, dtype: object

In [35]:
df2.loc[:,"D"]

0    3
1    3
2    3
3    3
Name: D, dtype: int32

In [36]:
df2.loc[[0,1], ["C","D"]]

   C  D
0  1  3
1  1  3

In [39]:
df2.loc[:,"E"]

0     test
1    train
2     test
3    train
Name: E, dtype: object

In [40]:
df2.loc[:,"E"] == "test"

0     True
1    False
2     True
3    False
Name: E, dtype: bool

In [41]:
df2.loc[df2.loc[:,"E"] == "test",:]

   A          B  C  D     E    F    T
0  1 2013-01-02  1  3  test  foo    1
2  1 2013-01-02  1  3  test  foo  bob

In [45]:
df2.loc[(df2.loc[:,"E"] == "test") & (df2.loc[:,"T"] == "bob"),
        :]

   A          B  C  D     E    F    T
2  1 2013-01-02  1  3  test  foo  bob

#Friday's Material